Series

In [1]:
#dic()>>>Series()

In [4]:
import pandas as pd

_dict = {'a':1, 'b':2, 'c':3}

pd.Series(_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
sr = pd.Series(_dict)

In [6]:
print(type(sr))

<class 'pandas.core.series.Series'>

In [7]:
print('\n')

In [8]:
print(sr)

a    1
b    2
c    3
dtype: int64

In [10]:
#list>>>Series

import pandas as pd

_list = ['2022-05-26', 3.14, 'abc', 100, True]
pd.Series(_list)

0    2022-05-26
1          3.14
2           abc
3           100
4          True
dtype: object

In [11]:
ls = pd.Series(_dict)

In [12]:
ls.index

Index(['a', 'b', 'c'], dtype='object')

In [13]:
ls.values

array([1, 2, 3])

In [15]:
#Series 원소선택

import pandas as pd

_tuple = ('멀티캠퍼스','2022-05-26','여',True)
ts = pd.Series(_tuple, index = ['이름','생년월일','성별','학생여부'])
ts

이름           멀티캠퍼스
생년월일    2022-05-26
성별               여
학생여부          True
dtype: object

In [16]:
ts[0]

'멀티캠퍼스'

In [17]:
ts['이름']

'멀티캠퍼스'

In [18]:
ts[-1]

True

In [22]:
ts[1:2]

생년월일    2022-05-26
dtype: object

DataFrame

In [24]:
import pandas as pd

_dict = {'c0':[1,2,3],'c1':[4,5,6], 'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}

In [25]:
pd.DataFrame(_dict)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [26]:
df = pd.DataFrame(_dict)

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
import pandas as pd

In [46]:
#여러개를 담으려면 []가 하나 더 있어야 한다.단,데이터에만 괄호를 더 넣는다.
df1 = pd.DataFrame([[28,'여','주혜린','멀티캠퍼스'],[27,'남','신상연','멀티캠퍼스'],
              [26,'여','오보민','서울대'],[27,'남','박준하','카이스트']],
              index = ['1번','2번','3번','4번'],
              columns = ['나이','성별','이름','소속기관'])

In [47]:
df2 = df1.index = ['20220101','20220102','20220103','20220104']

In [48]:
df2

['20220101', '20220102', '20220103', '20220104']

In [49]:
df2 = df1.columns = ['age','gender','name','organization']

In [50]:
df2

['age', 'gender', 'name', 'organization']

In [57]:
df1.rename(columns = {'나이':'age','성별':'gender','이름':'name','소속기관':'organization'},
            inplace = True)

In [58]:
df1.rename(index = {'1번':'20220101','2번':'20220102','3번':'20220103','4번':'20220104'},
         inplace = True)

In [59]:
df1

          age gender name organization
20220101   28      여  주혜린        멀티캠퍼스
20220102   27      남  신상연        멀티캠퍼스
20220103   26      여  오보민          서울대
20220104   27      남  박준하         카이스트

In [60]:
import pandas as pd

exam_data = {'수학' : [90,80,70],'영어' : [98,89,95],
            '음악' : [85,95,100],'체육' : [100,90,90]}

df = pd.DataFrame(exam_data, index =['서준','우현','인아'])

df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [66]:
df2 = df[:] #all

In [67]:
df2.drop('우현', inplace=True)
df2

/var/folders/n4/tlr0x9b97v3bzyh49yfs3ps00000gn/T/ipykernel_3096/1206593567.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('우현', inplace=True)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [68]:
df3 = df[:]
df3.drop(['우현','인아'], axis = 0, inplace=True)
df3

/var/folders/n4/tlr0x9b97v3bzyh49yfs3ps00000gn/T/ipykernel_3096/601408902.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop(['우현','인아'], axis = 0, inplace=True)

    수학  영어  음악   체육
서준  90  98  85  100

In [69]:
df4 = df[:]
df4.drop(['음악','체육'], axis = 1, inplace=True)
df4

/var/folders/n4/tlr0x9b97v3bzyh49yfs3ps00000gn/T/ipykernel_3096/3050702150.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4.drop(['음악','체육'], axis = 1, inplace=True)

    수학  영어
서준  90  98
우현  80  89
인아  70  95

In [71]:
import pandas as pd

exam_data = {'수학' : [90,80,70],'영어' : [98,89,95],
            '음악' : [85,95,100],'체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준','우현','인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [74]:
label1 = df.loc['서준']
position1 = df.iloc[0]
print(label1)
print('\n')
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64


수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [75]:
import pandas as pd

student1 = pd.Series({'국어':100,'영어':80, '수학':90})
print(student1)

국어    100
영어     80
수학     90
dtype: int64

In [76]:
percentage = student1/200

In [77]:
percentage

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [78]:
type(percentage)

pandas.core.series.Series

In [80]:
student1 = pd.Series({'국어':100,'영어':80, '수학':90})
student2 = pd.Series({'수학':80,'국어':90, '영어':80})

print(student1)
print(student2)

addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2

print(type(division))

국어    100
영어     80
수학     90
dtype: int64
수학    80
국어    90
영어    80
dtype: int64
<class 'pandas.core.series.Series'>

In [81]:
result = pd.DataFrame([addition,subtraction,multiplication,division],
                     index = ['덧셈','뺄셈','곱셈','나눗셈'])
print(result)

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [82]:
import pandas as pd
import numpy as np

In [83]:
stu1 = pd.Series({'국어':np.nan, '영어': 80, '수학':90})